reports_1858/Redis-benchmark/redis.log
PING_INLINE: 0.00
PING_INLINE: 3799.23
PING_INLINE: 4106.09
PING_INLINE: 4097.50
PING_INLINE: 4091.18
PING_INLINE: 4192.22
PING_INLINE: 4302.85
PING_INLINE: 4340.53
PING_INLINE: 4373.32
====== PING_INLINE ======
  10000 requests completed in 2.26 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

26.57% <= 1 milliseconds
92.09% <= 2 milliseconds
98.91% <= 3 milliseconds
99.56% <= 4 milliseconds
99.72% <= 5 milliseconds
99.80% <= 6 milliseconds
99.84% <= 7 milliseconds
99.87% <= 8 milliseconds
99.89% <= 12 milliseconds
99.91% <= 13 milliseconds
99.93% <= 18 milliseconds
99.94% <= 19 milliseconds
99.95% <= 20 milliseconds
99.96% <= 21 milliseconds
99.97% <= 22 milliseconds
99.98% <= 23 milliseconds
99.99% <= 24 milliseconds
100.00% <= 25 milliseconds
4428.70 requests per second

PING_BULK: 0.00
PING_BULK: 4256.92
PING_BULK: 4204.77
PING_BULK: 4232.10
PING_BULK: 4281.87
PING_BULK: 4365.23
PING_BULK: 4416.89
PING_BULK: 4419.61
PING_BULK: 4423.15
====== PING_BULK ======
  10000 requests completed in 2.25 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

24.13% <= 1 milliseconds
92.88% <= 2 milliseconds
99.48% <= 3 milliseconds
99.90% <= 4 milliseconds
99.93% <= 5 milliseconds
99.95% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 10 milliseconds
4442.47 requests per second

SET: 0.00
SET: 4710.32
SET: 4687.25
SET: 4779.55
SET: 4741.77
SET: 4685.55
SET: 4697.27
SET: 4746.72
SET: 4586.12
====== SET ======
  10000 requests completed in 2.23 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

33.94% <= 1 milliseconds
89.84% <= 2 milliseconds
98.64% <= 3 milliseconds
99.82% <= 4 milliseconds
99.95% <= 5 milliseconds
99.97% <= 6 milliseconds
99.98% <= 7 milliseconds
99.99% <= 10 milliseconds
100.00% <= 11 milliseconds
4474.27 requests per second

GET: 2750.00
GET: 2893.70
GET: 3513.89
GET: 3908.49
GET: 4068.73
GET: 4090.04
GET: 4144.75
GET: 4206.72
GET: 4261.22
GET: 4165.34
====== GET ======
  10000 requests completed in 2.39 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

23.85% <= 1 milliseconds
88.27% <= 2 milliseconds
98.59% <= 3 milliseconds
99.72% <= 4 milliseconds
99.77% <= 5 milliseconds
99.78% <= 6 milliseconds
99.79% <= 7 milliseconds
99.81% <= 8 milliseconds
99.86% <= 9 milliseconds
99.88% <= 10 milliseconds
99.89% <= 11 milliseconds
99.90% <= 18 milliseconds
99.91% <= 26 milliseconds
99.92% <= 40 milliseconds
99.94% <= 41 milliseconds
99.96% <= 42 milliseconds
99.98% <= 43 milliseconds
100.00% <= 44 milliseconds
4187.60 requests per second

INCR: 4886.79
INCR: 4733.15
INCR: 4627.06
INCR: 4723.13
INCR: 4792.95
INCR: 4799.41
INCR: 4808.84
INCR: 4746.77
====== INCR ======
  10000 requests completed in 2.11 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

35.92% <= 1 milliseconds
92.55% <= 2 milliseconds
99.01% <= 3 milliseconds
99.69% <= 4 milliseconds
99.78% <= 5 milliseconds
99.85% <= 6 milliseconds
99.90% <= 7 milliseconds
99.97% <= 8 milliseconds
100.00% <= 9 milliseconds
4750.59 requests per second

LPUSH: 0.00
LPUSH: 4614.17
LPUSH: 4696.43
LPUSH: 4630.46
LPUSH: 4495.04
LPUSH: 4505.56
LPUSH: 4527.85
LPUSH: 4525.54
LPUSH: 4421.47
====== LPUSH ======
  10000 requests completed in 2.23 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

31.49% <= 1 milliseconds
88.32% <= 2 milliseconds
98.40% <= 3 milliseconds
99.78% <= 4 milliseconds
99.87% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 7 milliseconds
4478.28 requests per second

RPUSH: 5058.82
RPUSH: 4223.88
RPUSH: 4474.90
RPUSH: 4720.05
RPUSH: 4656.53
RPUSH: 4703.70
RPUSH: 4622.78
RPUSH: 4621.25
RPUSH: 4565.63
====== RPUSH ======
  10000 requests completed in 2.20 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

29.49% <= 1 milliseconds
90.54% <= 2 milliseconds
98.97% <= 3 milliseconds
99.80% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 5 milliseconds
4535.15 requests per second

LPOP: 3836.73
LPOP: 4190.64
LPOP: 4486.34
LPOP: 4623.28
LPOP: 4713.06
LPOP: 4641.26
LPOP: 4717.24
LPOP: 4728.74
LPOP: 4738.41
====== LPOP ======
  10000 requests completed in 2.11 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

36.06% <= 1 milliseconds
92.43% <= 2 milliseconds
99.28% <= 3 milliseconds
99.96% <= 8 milliseconds
100.00% <= 9 milliseconds
4743.83 requests per second

RPOP: 4657.30
RPOP: 4703.27
RPOP: 4336.28
RPOP: 4079.66
RPOP: 3625.53
RPOP: 3337.98
RPOP: 3106.17
RPOP: 2933.88
RPOP: 2850.48
RPOP: 2767.75
RPOP: 2685.39
RPOP: 2648.64
RPOP: 2572.68
RPOP: 2486.49
RPOP: 2451.94
RPOP: 2420.89
====== RPOP ======
  10000 requests completed in 4.11 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

8.95% <= 1 milliseconds
45.17% <= 2 milliseconds
82.07% <= 3 milliseconds
94.32% <= 4 milliseconds
96.71% <= 5 milliseconds
97.93% <= 6 milliseconds
98.83% <= 7 milliseconds
99.23% <= 8 milliseconds
99.48% <= 9 milliseconds
99.61% <= 10 milliseconds
99.71% <= 11 milliseconds
99.81% <= 12 milliseconds
99.87% <= 13 milliseconds
99.93% <= 14 milliseconds
99.95% <= 15 milliseconds
99.96% <= 16 milliseconds
99.97% <= 17 milliseconds
99.98% <= 19 milliseconds
99.99% <= 20 milliseconds
100.00% <= 22 milliseconds
2433.68 requests per second

SADD: 2876.71
SADD: 2795.67
SADD: 2785.34
SADD: 2574.03
SADD: 2476.28
SADD: 2417.04
SADD: 2365.48
SADD: 2385.88
SADD: 2398.94
SADD: 2589.35
SADD: 2799.46
SADD: 2992.22
SADD: 3151.02
====== SADD ======
  10000 requests completed in 3.14 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

19.37% <= 1 milliseconds
66.63% <= 2 milliseconds
94.00% <= 3 milliseconds
98.77% <= 4 milliseconds
99.38% <= 5 milliseconds
99.60% <= 6 milliseconds
99.76% <= 7 milliseconds
99.81% <= 9 milliseconds
99.83% <= 10 milliseconds
99.84% <= 11 milliseconds
99.88% <= 12 milliseconds
99.94% <= 13 milliseconds
99.98% <= 14 milliseconds
100.00% <= 14 milliseconds
3181.67 requests per second

HSET: 4819.77
HSET: 4651.66
HSET: 4752.98
HSET: 4764.64
HSET: 4730.38
HSET: 4765.82
HSET: 4720.10
HSET: 4689.91
====== HSET ======
  10000 requests completed in 2.16 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

34.64% <= 1 milliseconds
88.97% <= 2 milliseconds
98.69% <= 3 milliseconds
99.76% <= 4 milliseconds
99.91% <= 5 milliseconds
99.97% <= 6 milliseconds
100.00% <= 7 milliseconds
4631.77 requests per second

SPOP: 0.00
SPOP: 4027.78
SPOP: 4221.12
SPOP: 4263.30
SPOP: 4302.09
SPOP: 4229.05
SPOP: 4284.10
SPOP: 4162.01
SPOP: 4218.17
SPOP: 4234.69
====== SPOP ======
  10000 requests completed in 2.35 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

26.36% <= 1 milliseconds
88.20% <= 2 milliseconds
98.54% <= 3 milliseconds
99.78% <= 4 milliseconds
99.96% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 8 milliseconds
4258.94 requests per second

LPUSH (needed to benchmark LRANGE): 3572.41
LPUSH (needed to benchmark LRANGE): 3227.27
LPUSH (needed to benchmark LRANGE): 3116.10
LPUSH (needed to benchmark LRANGE): 3606.03
LPUSH (needed to benchmark LRANGE): 3727.75
LPUSH (needed to benchmark LRANGE): 3945.56
LPUSH (needed to benchmark LRANGE): 4052.25
LPUSH (needed to benchmark LRANGE): 4161.92
LPUSH (needed to benchmark LRANGE): 4207.36
====== LPUSH (needed to benchmark LRANGE) ======
  10000 requests completed in 2.36 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

25.56% <= 1 milliseconds
83.04% <= 2 milliseconds
97.62% <= 3 milliseconds
99.69% <= 4 milliseconds
100.00% <= 4 milliseconds
4233.70 requests per second

LRANGE_100 (first 100 elements): 2944.44
LRANGE_100 (first 100 elements): 2762.08
LRANGE_100 (first 100 elements): 2855.49
LRANGE_100 (first 100 elements): 2729.87
LRANGE_100 (first 100 elements): 2578.84
LRANGE_100 (first 100 elements): 2518.49
LRANGE_100 (first 100 elements): 2597.63
LRANGE_100 (first 100 elements): 2619.42
LRANGE_100 (first 100 elements): 2681.50
LRANGE_100 (first 100 elements): 2684.42
LRANGE_100 (first 100 elements): 2699.05
LRANGE_100 (first 100 elements): 2694.81
LRANGE_100 (first 100 elements): 2727.33
LRANGE_100 (first 100 elements): 2753.36
LRANGE_100 (first 100 elements): 2742.19
====== LRANGE_100 (first 100 elements) ======
  10000 requests completed in 3.65 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
47.35% <= 2 milliseconds
86.89% <= 3 milliseconds
97.38% <= 4 milliseconds
99.32% <= 5 milliseconds
99.76% <= 6 milliseconds
99.86% <= 7 milliseconds
99.95% <= 8 milliseconds
100.00% <= 8 milliseconds
2738.23 requests per second

LRANGE_300 (first 300 elements): 1609.52
LRANGE_300 (first 300 elements): 1656.34
LRANGE_300 (first 300 elements): 1680.99
LRANGE_300 (first 300 elements): 1656.94
LRANGE_300 (first 300 elements): 1677.80
LRANGE_300 (first 300 elements): 1690.21
LRANGE_300 (first 300 elements): 1698.76
LRANGE_300 (first 300 elements): 1708.38
LRANGE_300 (first 300 elements): 1718.41
LRANGE_300 (first 300 elements): 1701.18
LRANGE_300 (first 300 elements): 1681.44
LRANGE_300 (first 300 elements): 1680.14
LRANGE_300 (first 300 elements): 1681.19
LRANGE_300 (first 300 elements): 1687.93
LRANGE_300 (first 300 elements): 1694.37
LRANGE_300 (first 300 elements): 1699.72
LRANGE_300 (first 300 elements): 1697.87
LRANGE_300 (first 300 elements): 1695.61
LRANGE_300 (first 300 elements): 1686.26
LRANGE_300 (first 300 elements): 1693.58
LRANGE_300 (first 300 elements): 1697.08
LRANGE_300 (first 300 elements): 1695.91
LRANGE_300 (first 300 elements): 1697.44
====== LRANGE_300 (first 300 elements) ======
  10000 requests completed in 5.88 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.52% <= 2 milliseconds
42.42% <= 3 milliseconds
88.33% <= 4 milliseconds
98.08% <= 5 milliseconds
99.66% <= 6 milliseconds
99.94% <= 7 milliseconds
99.97% <= 8 milliseconds
100.00% <= 8 milliseconds
1700.97 requests per second

LRANGE_500 (first 450 elements): 0.00
LRANGE_500 (first 450 elements): 1144.53
LRANGE_500 (first 450 elements): 1226.82
LRANGE_500 (first 450 elements): 1236.46
LRANGE_500 (first 450 elements): 1248.02
LRANGE_500 (first 450 elements): 1270.85
LRANGE_500 (first 450 elements): 1282.31
LRANGE_500 (first 450 elements): 1296.42
LRANGE_500 (first 450 elements): 1300.85
LRANGE_500 (first 450 elements): 1314.46
LRANGE_500 (first 450 elements): 1323.78
LRANGE_500 (first 450 elements): 1321.16
LRANGE_500 (first 450 elements): 1330.02
LRANGE_500 (first 450 elements): 1333.84
LRANGE_500 (first 450 elements): 1341.68
LRANGE_500 (first 450 elements): 1349.00
LRANGE_500 (first 450 elements): 1356.66
LRANGE_500 (first 450 elements): 1357.33
LRANGE_500 (first 450 elements): 1363.23
LRANGE_500 (first 450 elements): 1369.78
LRANGE_500 (first 450 elements): 1374.88
LRANGE_500 (first 450 elements): 1379.42
LRANGE_500 (first 450 elements): 1383.47
LRANGE_500 (first 450 elements): 1380.03
LRANGE_500 (first 450 elements): 1384.01
LRANGE_500 (first 450 elements): 1386.82
LRANGE_500 (first 450 elements): 1390.06
LRANGE_500 (first 450 elements): 1392.65
LRANGE_500 (first 450 elements): 1389.78
====== LRANGE_500 (first 450 elements) ======
  10000 requests completed in 7.19 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.02% <= 2 milliseconds
7.87% <= 3 milliseconds
60.33% <= 4 milliseconds
86.39% <= 5 milliseconds
94.33% <= 6 milliseconds
97.51% <= 7 milliseconds
98.92% <= 8 milliseconds
99.53% <= 9 milliseconds
99.78% <= 10 milliseconds
99.87% <= 11 milliseconds
99.92% <= 12 milliseconds
99.96% <= 13 milliseconds
99.97% <= 15 milliseconds
100.00% <= 15 milliseconds
1390.82 requests per second

LRANGE_600 (first 600 elements): 875.00
LRANGE_600 (first 600 elements): 1021.74
LRANGE_600 (first 600 elements): 1105.90
LRANGE_600 (first 600 elements): 1108.96
LRANGE_600 (first 600 elements): 1127.32
LRANGE_600 (first 600 elements): 1140.06
LRANGE_600 (first 600 elements): 1140.60
LRANGE_600 (first 600 elements): 1122.95
LRANGE_600 (first 600 elements): 1106.73
LRANGE_600 (first 600 elements): 1098.89
LRANGE_600 (first 600 elements): 1095.86
LRANGE_600 (first 600 elements): 1096.55
LRANGE_600 (first 600 elements): 1100.03
LRANGE_600 (first 600 elements): 1105.92
LRANGE_600 (first 600 elements): 1109.94
LRANGE_600 (first 600 elements): 1113.71
LRANGE_600 (first 600 elements): 1120.69
LRANGE_600 (first 600 elements): 1120.63
LRANGE_600 (first 600 elements): 1124.92
LRANGE_600 (first 600 elements): 1125.08
LRANGE_600 (first 600 elements): 1128.53
LRANGE_600 (first 600 elements): 1130.68
LRANGE_600 (first 600 elements): 1136.20
LRANGE_600 (first 600 elements): 1138.22
LRANGE_600 (first 600 elements): 1142.72
LRANGE_600 (first 600 elements): 1139.58
LRANGE_600 (first 600 elements): 1140.65
LRANGE_600 (first 600 elements): 1140.61
LRANGE_600 (first 600 elements): 1141.39
LRANGE_600 (first 600 elements): 1141.32
LRANGE_600 (first 600 elements): 1144.30
LRANGE_600 (first 600 elements): 1146.55
LRANGE_600 (first 600 elements): 1148.77
LRANGE_600 (first 600 elements): 1150.65
LRANGE_600 (first 600 elements): 1153.07
====== LRANGE_600 (first 600 elements) ======
  10000 requests completed in 8.67 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
0.02% <= 2 milliseconds
0.44% <= 3 milliseconds
22.54% <= 4 milliseconds
60.90% <= 5 milliseconds
82.32% <= 6 milliseconds
91.97% <= 7 milliseconds
96.00% <= 8 milliseconds
97.75% <= 9 milliseconds
98.71% <= 10 milliseconds
99.22% <= 11 milliseconds
99.42% <= 12 milliseconds
99.60% <= 13 milliseconds
99.75% <= 14 milliseconds
99.76% <= 15 milliseconds
99.83% <= 16 milliseconds
99.85% <= 17 milliseconds
99.88% <= 18 milliseconds
99.89% <= 19 milliseconds
99.91% <= 20 milliseconds
99.92% <= 21 milliseconds
99.95% <= 22 milliseconds
99.96% <= 24 milliseconds
99.97% <= 26 milliseconds
99.99% <= 27 milliseconds
100.00% <= 28 milliseconds
1153.40 requests per second

MSET (10 keys): 4205.41
MSET (10 keys): 3393.10
MSET (10 keys): 3639.42
MSET (10 keys): 3672.73
MSET (10 keys): 3859.07
MSET (10 keys): 3927.53
MSET (10 keys): 3959.64
MSET (10 keys): 3995.87
MSET (10 keys): 3994.51
MSET (10 keys): 4016.43
====== MSET (10 keys) ======
  10000 requests completed in 2.48 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

9.19% <= 1 milliseconds
69.12% <= 2 milliseconds
93.27% <= 3 milliseconds
98.78% <= 4 milliseconds
99.68% <= 5 milliseconds
99.84% <= 6 milliseconds
99.87% <= 7 milliseconds
99.88% <= 9 milliseconds
99.90% <= 10 milliseconds
99.92% <= 11 milliseconds
99.94% <= 12 milliseconds
99.95% <= 23 milliseconds
99.96% <= 24 milliseconds
99.97% <= 25 milliseconds
99.98% <= 26 milliseconds
100.00% <= 27 milliseconds
4025.76 requests per second